<?PHP // $Id$ 
      // admin.php - created with Moodle 1.8 + (2007021502)


$string['accounts'] = 'Облікові записи
';
$string['antivirus'] = 'Антивірус';
$string['appearance'] = 'Зовнішній вигляд';
$string['authentication'] = 'Аутентифікація';
$string['backups'] = 'Резервні копії';
$string['bookmarkdeleted'] = 'Закладка видалена.';
$string['bookmarkthispage'] = 'закладка для цієї сторінки';
$string['cachetext'] = 'закладка для цієї сторінки(Text cache)';
$string['calendarsettings'] = 'Календар';
$string['cleanup'] = 'Очищення';
$string['configallowunenroll'] = 'Якщо встановлено \"Так\", то студентам буде дозволено \"відписуватися\" від даного курсу у будь-який момент, коли  вони цього захочуть. Якщо \"Ні\", то студенти не зможуть  \"відписуватися\" від курсу. Це зробити можуть тільки викладачі або адміністратори.';
$string['configautologinguests'] = 'Чи повинні відвідувачі автоматично заходити в курс під обліковим записом гостя, якщо гостьовий доступ для курсу дозволений?';
$string['configcachetext'] = 'Для великих сайтів або сайтів, які використовують текстові фільтри ці налаштування можуть реально збільшити швидкість роботи. Копії текстів зберігатимуться в процесі обробки форм на вказаний тут час. Установка дуже маленького часу звичайно може привести до уповільнення роботи, але установка дуже великого часу також може привести до труднощів, пов\'язаних з оновленнями (наприклад, з новими посиланнями). Вибирайте розумно!';
$string['configcountry'] = 'Якщо ви хочете, щоб користувач вибирав в цьому полі країну, залиште його порожнім';
$string['configdebug'] = 'Якщо ви включите цю опцію, повідомлення про помилки і попередження PHP виводитимуться на екран частіше.<br />(Використовується на стадії розробки
)';
$string['configdeleteunconfirmed'] = 'Якщо Ви використовуєте аутентифікацію за допомогою електронної пошти, то тут указується період на протязі якого відповідь від користувача буде прийнята для реєстрації в системі. Після цього періоду всі незареєстровані облікові записи будуть автоматично видалені
.';
$string['configdigestmailtime'] = 'Користувачі, які вибрали посилку пошти у вигляді дайджеста одержуватимуть його щодня. Дана опція управляє часом дня, після якого відбувається посилка (перший запущений після даного часу cron відправить пошту
).';
$string['configenablerssfeeds'] = 'Ця опція відстежує зміни в форматі RSS на всьому сайті. Для того, щоб фактично бачити різні зміни, Ви  повинні також дозволити  RSS в індивідуальних модулях (в режимі Адміністратора - налаштування модулів).';
$string['configenablerssfeedsdisabled'] = 'Це недоступно тому, що формат RSS не включений у всіх модулях на всьому сайті. Щоб зробити це доступним необхідно в режимі Адміністратора змінити налаштування змінних.';
$string['configerrorlevel'] = 'Кількість повідомлень про помилки і попередження PHP, що виводяться на екран';
$string['configextendedusernamechars'] = 'Це налаштування дозволяє студентам використовувати будь-які символи і знаки при введенні імені (username) - фактично це не міняє реальне ім\'я студента. За умовчанням це налаштування - помилкове (false), тобто відключена і отже студенти можуть вживати в своєму імені тільки букви і цифри.';
$string['configfilteruploadedfiles'] = 'Якщо дана установка вибрана, то в процесі завантаження  html і текстових файлів буде проводиться попередня фільтрація їх перед висновком на екран.';
$string['configforcelogin'] = 'Звичайно, доступ до першої сторінки сайту і до списку курсів здійснюється без попередньої реєстрації. Якщо Ви хочете, щоб всі користувачі до всіх Ваших матеріалів сайту мали доступ тільки після реєстрації виберіть дану установку.';
$string['configforceloginforprofiles'] = 'Це налаштування дозволяє примусово всім користувачам (не гостей) проходити через реєстрацію для отримання персональної інформації про інших користувачів. За умовчанням, це налаштування вимкнено (false), так що передбачувані студенти (тільки що реєструються в системі) могли проглянути інформацію про викладачів будь-якого  курсу, але це також дає можливість скористатися цією інформацією і пошуковими  машинами в Інтернеті.';
$string['configframename'] = 'Якщо Ви вбудували систему в web-фрейм, напишіть ім\'я фрейма тут. Інакше - поле повинне містити \'_top\'';
$string['configfullnamedisplay'] = 'Це налаштування визначає як відображатимуться дані про користувача при виводі повної інформації про нього. Для одних мовних сайтів за замовчанням стоїть налаштування \"Given names + Surname\" (Ім\'я + Прізвище), але Ви можете заховати прізвище завжди або залишити дане поле порожнім (у деяких мовах існують різні угоди з даного приводу).';
$string['configgdversion'] = 'Версія встановленого GD. За замовчанням визначається автоматично.';
$string['confightmleditor'] = 'Виберіть, дозволяється чи ні користувачу застосовувати вбудований HTML редактор (редактор працює в браузерах IE версій 5.5 і вище).';
$string['configidnumber'] = 'Ця опція визначає, (a) Не питати користувача про ID, (b) Користувача просять ввести ID, але користувач може не вводити його (c) Користувача просять ввести ID, і користувач повинен його вводити. Якщо вказане ID-число, то воно показується в профайлі користувача.';
$string['configintro'] = 'Виберіть конфігураційні змінні для налаштування системи на сервері. Ви зможете повернутися на цю сторінку пізніше і змінити значення';
$string['configintroadmin'] = 'На цій сторінці Вам необхідно заповнити аккаунт основного адміністратора, який матиме повний контроль над сайтом. Переконайтеся, що вказали безпечний пароль, логін і достовірний e-mail. Пізніше Ви зможете додати адміністраторів.';
$string['configintrosite'] = 'На цій сторінці Ви можете налаштувати вид першої сторінки і дати назву Вашому сайту. Ви зможете повернутися на цю сторінку пізніше, використовуючи посилання \'Налаштування сайту\'.';
$string['configlang'] = 'Виберіть встановлену за умовчанням мову для всього сайту.';
$string['configlangdir'] = 'Більшість іноземних мов друкуються зліва на право, але деякі, наприклад, арабська, справа наліво.';
$string['configlanglist'] = 'Залиште цю опцію порожньою, якщо хочете, щоб користувач мав можливість вибирати, використовувану мову. Ви можете скоротити меню з пропонованими мовами, ввівши позначення для бажаних мов, розділені комами. Наприклад ru,en.';
$string['configlangmenu'] = 'Виберіть відображати чи ні користувачам меню для вибору мови, що використовується на сайті. Це не вплине на можливість користувача вибрати мову, якій надається перевага, в своєму профайлі.';
$string['configlocale'] = 'Виберіть специфікацію, яка використовуватиметься на сайті (впливає на формат і мову запису дат). Якщо ви не знаєте що вибрати, залиште поле порожнім.';
$string['configloglifetime'] = 'Поле визначає відрізок часу, який Ви хочете зберігати балки про діяльність користувачів. Балки, старші за цей вік, автоматично віддаляються. Звичайно балки зберігають максимально довго, але у випадку, якщо Ваш сервер має обмежене вільне місце і у вас виникають проблеми з роботою, Вам необхідно знизити цей параметр.';
$string['configlongtimenosee'] = 'Параметр, що визначає, протягом якого часу студент може не з\'являтися на сайті і при цьому автоматично не виключатися з курсів.';
$string['configmaxbytes'] = 'Цей параметр визначає максимальний розмір завантажуваних на сайт зовнішніх файлів. Цей параметр в свою чергу обмежений налаштуванням в PHP - setting upload_max_filesize і в Apache - LimitRequestBody. Звичайно, максимальний розмір завантажуваних файлів може бути визначений на рівні курсу або на рівні модуля.';
$string['configmaxeditingtime'] = 'Час, протягом якого користувач може змінити надіслане на форум повідомлення... Як правило використовується значення 30 мін';
$string['confignoreplyaddress'] = 'Іноді повідомлення електронної пошти послаются без безпосередньої участі користувача (наприклад повідомлення з форуму). Адреса електронної пошти, вказана тут, буде використана як адреса зворотного зв\'язку, у випадку, якщо одержувачі не повинні звертатися безпосередньо до користувача (якщо користувач не бажає показувати свою адресу)';
$string['configopentogoogle'] = 'Якщо ви вибираєте це налаштування, то пошукова машина  Google (www.google.com) дозволяє зареєструвати ваш сайт як Гостя. Крім того, люди, що входять на Ваш сайт через пошук Google, автоматично реєструватимуться на Вашому сайті як Гість. Примітка,  це тільки забезпечує простий доступ  до курсів, які вже дозволяють гостьовий доступ.';
$string['configproxyhost'] = 'Якщо <b>серверу</b> необхідний proxy (firewall) для доступу в Internet, напишіть ім\'я хоста і порт тут, інакше залиште поле порожнім.';
$string['configsectionpermissions'] = 'Права';
$string['configsectionsecurity'] = 'Безпека';
$string['configsectionstats'] = 'Статистика';
$string['configsecureforms'] = 'Система може використовувати додатковий рівень безпеки при отриманні даних з web через форми. Якщо опція включена, то змінна браузера HTTP_REFERER звіряється  з поточною адресою форми. У дуже небагатьох випадках це може викликати проблеми, наприклад, якщо користувач використовує систему мережевого захисту (наприклад, Zonealarm) конфігурований так, щоб відокремлювати HTTP_REFERER від трафіку мережі. Симптом - \'прилипання\' до форми. Якщо Ваші користувачі мають проблеми при вході в систему, можливо, слід відключити це налаштування, хоча це могло б залишити ваш сайт відкритішим для підбору пароля перебором. Якщо Ви сумніваєтеся, залиште налаштування включеним.';
$string['configsessioncookie'] = 'Це налаштування призначеного для користувача імені для механізму cookie, який використовується при роботі з сесіями (sessions). Воно не обов\'язкове, проте корисно було б використовувати оригінальні cookie при запуску декількох сесій на одному сайті.';
$string['configsessiontimeout'] = 'Якщо відвідувач зайшов на сайт і нічого не робить на протязі деякого часу (не завантажує сторінки), він автоматично вивантажується (сесія закінчується). Ця змінна задає час.';
$string['configslasharguments'] = 'Файли (зображення, закачані файли...) задаються скриптом, використовуючи слеш (друга опція). Цей метод дозволяє файлам найпростіше кешуватися на серверах. На жаль, деякі PHP-сервера не підтримують цей метод. Якщо у вас виникають проблеми з прогляданням завантажених файлів або картинок (фотографій користувачів), встановіть першу опцію';
$string['configsmtphosts'] = 'Напишіть повне ім\'я вашого SMTP сервера, яким система скористається для відправки пошти (формат mail.a.com). Якщо ви залишите поле порожнім, система скористається встановленим в PHP методом для відправки пошти';
$string['configsmtpuser'] = 'Якщо ви налаштували в попередньому полі ім\'я SMTP сервера і йому необхідна аутентифікація, налаштуйте ім\'я користувача і пароль тут';
$string['configteacherassignteachers'] = 'Чи можуть звичайні викладачі призначати інших викладачів для курсів, де вони викладають? Якщо \'Ні\', тоді тільки творці курсів і адміністратори можуть призначати викладачів.';
$string['configtimezone'] = 'Тут Ви можете встановити \"тимчасову зону\" - timezone. Це буде часова зона за замовчанням для виведення системних дат і часу, при цьому кожний з користувачів зможе змінити для себе часову зону в своєму профайлі. Налаштування \"Server time\"- \"Серверний час\" робить установку відповідно до установок операційної системи на сервері.';
$string['configunzip'] = 'Пропишіть шлях до програми unzip (тільки для Юнікс). Необхідно для розпаковування zip-архівів на вашому сервері';
$string['configvariables'] = 'Налаштування змінних';
$string['configwarning'] = 'Будьте уважними при зміні цих налаштувань, невірні налаштування можуть привести до проблем.';
$string['configzip'] = 'Пропишіть шлях до програми zip (тільки для Юнікс). Необхідно для створення zip-архівів на вашому сервері';
$string['coursemanager'] = 'Відображення вчителів';
$string['coursemgmt'] = 'Додати/редагувати курси';
$string['courseoverview'] = 'Огляд курсів';
$string['courses'] = 'Курси';
$string['debugging'] = 'Відладка';
$string['environment'] = 'Середовище (версії ПО)';
$string['experimental'] = 'Експериментальні можливості';
$string['filtersettings'] = 'Налаштування фільтрів';
$string['filteruploadedfiles'] = 'Фільтрація завантажуваних файлів';
$string['frontpage'] = 'Головна сторінка';
$string['frontpagebackup'] = 'Резервна копія головної сторінки';
$string['frontpagerestore'] = 'Відновлення головної сторінки';
$string['frontpageroles'] = 'Ролі на головній сторінці';
$string['frontpagesettings'] = 'Налаштування головної сторінки';
$string['gradebook'] = 'Журнал оцінок';
$string['htmleditor'] = 'HTML редактор';
$string['httpsecurity'] = 'Безпека HTTP';
$string['langedit'] = 'Редагування мови';
$string['langpacks'] = 'Мовні пакети';
$string['languagesettings'] = 'Налаштування мови';
$string['location'] = 'Місцезнаходження';
$string['locationsettings'] = 'Налаштування місцезнаходження';
$string['log'] = 'Балки';
$string['modulesecurity'] = 'Безпека модулів';
$string['notifications'] = 'Повідомлення';
$string['performance'] = 'Продуктивність';
$string['plugins'] = 'Модулі';
$string['profilefields'] = 'Додаткові поля в профілі';
$string['security'] = 'Безпека';
$string['server'] = 'Сервер';
$string['sessionhandling'] = 'Обробка сесій';
$string['simpletest'] = 'Модульні тестування';
$string['sitemaintenancemode'] = 'Режим технічного обслуговування';
$string['sitepolicies'] = 'Політики сайту';
$string['stats'] = 'Статистика';
$string['stickyblocks'] = 'Закріплені блоки';
$string['systempaths'] = 'Системні шляхи';
$string['themeselector'] = 'Вибір теми';
$string['themesettings'] = 'Налаштування тем';
$string['unbookmarkthispage'] = 'видалити закладку для цієї сторінки';
$string['updatetimezones'] = 'Відновити часові зони';
$string['upgradelogs'] = 'Для повнішої функціональності Вашу стару системну інформацію (logs) необхідно оновлювати. <a href=\"$a\">Більше інформації</a>';
$string['upgradelogsinfo'] = 'З системною інформацією (logs) і її записом можуть відбуватися деякі зміни. Для того, щоб можна було переглядати всі старі logs на основі per-activity basis, Ваші старі logs повинні періодично оновлюватися. Це залежить від Вашого сайту і може займати багато часу (навіть декілька годин), і Ви можете навіть перевищити допустимі межі в БД для дуже великих сайтів. Проте Ви повинні запускати такий процес  оновлення системної інформації і не переривати його (не закривати вікна браузера) до повного закінчення. Не хвилюйтеся: під час такої роботи сайт для інших користувачів працюватиме в звичайному режимі. Ви хочете провести оновлення системної інформації (logs) прямо зараз?';
$string['upgradinglogs'] = 'Оновлення системної інформації (logs)';
$string['userlist'] = 'Робота із списком користувачів';
$string['userpolicies'] = 'Призначені для користувача політики';
$string['userrenamed'] = 'Перейменований користувач';
$string['users'] = 'Користувачі';
$string['userscreated'] = 'Створені користувачі';
$string['usersrenamed'] = 'Перейменовані користувачі';
$string['usersupdated'] = 'Оновлені користувачі';
$string['validateerror'] = 'Це значення не було дійсним:';




$string['defaultsettingsuser'] = 'Вкажіть тут id користувача. Інформація, вказана для цього користувача (формат e-mail, місто і т.д.), використовуватиметься за умовчанням для всіх створюваних користувачів'; // ORPHANED
$string['Miscellaneous'] = 'Різне';
?>
