<?php

// All of the language strings in this file should also exist in
// auth.php to ensure compatibility in all versions of Moodle.

$string['auth_ldap_bind_dn'] = 'Якщо Ви хочете за допомогою під\'єднаного користувача знайти інших користувачів, зазначте це тут. Наприклад, \'cn=ldapuser,ou=public,o=org\'';
$string['auth_ldap_bind_pw'] = 'Пароль для під\'єднаного користувача.';
$string['auth_ldap_contexts'] = 'Список контекстів користувачів . Відокремте різні контексти \';\'. Наприклад: \'ou=users,o=org; ou=others,o=org\'';
$string['auth_ldap_create_context'] = 'Якщо Ви дозволили реєстрування користувачів при підтвердженні поштою, визначте контекст, у який будуть вводитися користувачі. Цей контекст повинен відрізнятися від інших, щоб запобігти проблемам безпеки. Немає необхідності додавати, назва контексту до ldap_context-змінних, система буде шукати користувачів цього контексту автоматично.';
$string['auth_ldap_creators'] = 'Список груп, членам яких дозволяється створювати нові курси. Список груп розділяйте за допомогою \';\'. Наприклад,\'cn=teachers,ou=staff,o=myorg\'';
$string['auth_ldap_host_url'] = 'Зазначте LDAP-хост у вигляді URL\'а, наприклад \'ldap://ldap.myorg.com/\' або \'ldaps://ldap.myorg.com/\'';
$string['auth_ldap_memberattribute'] = 'Визначте атрибут користувача, за яким він є приналежним до групи. Звичайно - \'учасник\'';
$string['auth_ldap_search_sub'] = 'Укажіть значення <> 0 якщо Вам зручно шукати користувачів по субконтекстам.';
$string['auth_ldap_update_userinfo'] = 'Оновлюйте інформацію про користувачів(Ім\'я, Прізвище, адресу ..) від LDAP до системи. Дивіться /auth/ldap/attr_mappings.php для того, щоб відобразити інформацію.';
$string['auth_ldap_user_attribute'] = 'Атрибут,що використовується для імені/пошуку користувачів. Звичайно, \'cn\'.';
$string['auth_ldap_version'] = 'Версія LDAP протоколу, який використовує Ваш сервер';
$string['auth_ldapdescription'] = 'Цей метод забезпечує ідентифікацію за допомогою LDAP-сервера. Якщо даний логін і пароль чинні, створюється новий обліковий запис користувача у базі дані системи. Цей модуль може читати поля від LDAP-сервера й заповнювати необхідні області (поля) у системі. Надалі перевіряються тільки логін і пароль';
$string['auth_ldapextrafields'] = 'Ці поля додаткові. Ви можете обрати попереднє заповнення деяких полів даних користувачів з полів LDAP, зазначених тут. <br />Не заповнюйте це поле, для того, щоб не переносити дані СLDAP.<br />У кожному разі, користувач зможе редагувати всі поля після того, як він зайде в систему.';
$string['auth_ldaptitle'] = 'Використати LDAP-сервер';