<?php

// All of the language strings in this file should also exist in
// auth.php to ensure compatibility in all versions of Moodle.

$string['auth_emaildescription'] = 'Підтвердження за допомогою електронної пошти - використовуваний за замовчуванням метод ідентифікації. При реєстрації користувача, на зазначену адресу електронної пошти відправляється лист із проханням про підтвердження реєстрації. Лист містить безпечне посилання на сторінку, де користувач може підтвердити обліковий запис. Надалі при вході в систему звіряються ім\'я користувача і пароль із їхніми значеннями в базі даних.';
$string['auth_emailtitle'] = 'E-mail - ідентифікація';