<?php

// All of the language strings in this file should also exist in
// auth.php to ensure compatibility in all versions of Moodle.

$string['auth_dbdescription'] = 'Цей метод використовує зовнішню базу даних для перевірки пари логін/пароль. При створенні нового облікового запису, інформація з полів може бути скопійована в систему.';
$string['auth_dbextrafields'] = '<p>Ці поля додаткові. Ви можете обрати попереднє заповнення деяких полів даних користувачів з полів зовнішньої бази даних, зазначеної тут.</p> <p>Не заповнюйте поле, для використання налаштувань за замовченням </p>
<p>У кожному разі, користувач зможе редагувати всі поля після того, як він зайде в систему.</p>';
$string['auth_dbfieldpass'] = 'Назва поля, що містить пароль';
$string['auth_dbfielduser'] = 'Назва поля, що містить логін';
$string['auth_dbhost'] = 'Комп\'ютер, на якому запущено сервер бази даних.';
$string['auth_dbname'] = 'Назва бази даних';
$string['auth_dbpass'] = 'Пароль, що відповідає зазначеному логіну';
$string['auth_dbpasstype'] = 'Визначає формат використовуваних паролів.  MD5-кодування найбільш підходить при з\'єднанні з іншими web-додатками, наприклад, PostNuke';
$string['auth_dbtable'] = 'Назва таблиці в базі даних';
$string['auth_dbtitle'] = 'Використати зовнішню базу даних';
$string['auth_dbtype'] = 'Тип бази даних (Див. <a href=\"../lib/adodb/readme.htm#drivers\">Документацію по ADO db</a> для деталей)';
$string['auth_dbuser'] = 'Логін користувача із правами тільки на читання для бази даних';