<?PHP // $Id$ 
      // assignment.php - created with Moodle 1.8 + (2007021502)


$string['allowdeleting'] = 'Дозволити видалення';
$string['allowmaxfiles'] = 'Максимальне число завантажуваних файлів';
$string['allownotes'] = 'Дозволити комментарії';
$string['allowresubmit'] = 'Декілька спроб';
$string['assignmentdetails'] = 'Деталі завдання';
$string['assignmentmail'] = '$a->teacher написав відгук на Ваше завдання \'$a->assignment\'.

Ви можете подивитися його по ссилці:
$a->url';
$string['assignmentmailhtml'] = '$a->teacher написав відгук на Ваше завдання \'<i>$a->assignment</i>\'<br /><br />
Ви можете подивитися його 
 <a href=\"$a->url\">на сайті</a>.';
$string['assignmentname'] = 'Назва завдання';
$string['assignmenttype'] = 'Тип завдання';
$string['availabledate'] = 'Доступно з';
$string['comment'] = 'Відгук';
$string['commentinline'] = 'Включити у відгук текст відповіді студента';
$string['configmaxbytes'] = 'Встановлений за умовчанням максимальний розмір для всіх завдань на сайті (співвідноситься зі встановленим обмеженням по курсу і з іншими локальними установками)
';
$string['description'] = 'Опис
';
$string['draft'] = 'Чернетка';
$string['duedate'] = 'Останній термін здачі';
$string['duedateno'] = 'Термін здачі не обмежений';
$string['early'] = '$a рано';
$string['editmysubmission'] = 'Редагувати мою відповідь';
$string['emailteachermail'] = '$a->username відправив(ла) нову відповідь на завдання \'$a->assignment\'
Відповіді на це завдання доступні за адресою:
$a->url';
$string['emailteachermailhtml'] = '$a->username відправив(ла) нову відповідь на завдання <i>$a->assignment</i><br /><br />
Відповідь на це завдання <a href=\"$a->url\">розміщені на сайті</a>.';
$string['emailteachers'] = 'Відправляти повідомлення вчителям';
$string['emptysubmission'] = 'Ви ще нічого не відправляли.';
$string['existingfiledeleted'] = 'Існуючий файл був видалений: $a';
$string['failedupdatefeedback'] = 'Не вдалося оновити відгук користувача $a';
$string['feedback'] = 'Відгук';
$string['feedbackfromteacher'] = 'Відгук від $a';
$string['feedbackupdated'] = 'Відповідь змінений для $a';
$string['guestnosubmit'] = 'Вибачте, гость не може відправляти звіт на завдання. Вам необхідно <a href=\"../../login/\" title=\"Перейти на сторінку входу в систему\">увійти під своїм обліковим записом
</a> (или <a href=\"../../login/signup.php\" title=\"Перейти на сторінку створення нової облікового запису\">створити нову</a>, якщо у вас її немає), щоб ви мали змогу відправити відповдь';
$string['guestnoupload'] = 'Вибачте, гості не могуть відповідати на завдання';
$string['helpoffline'] = '<p>Цей режим корисний, коли завдання повинно бути виконано поза Moodle.</p>
<p>Наприклад, де-небудь в мережі або віч-на-віч з вчителем. Студенти можуть читати пояснення до завдання, але не можуть прислати не текст, не файл у відповідь.</p>
<p>Вчитель же, як і в інших видах, може написати свій відгук і поставити оцінку.</p>';
$string['helponline'] = '<p>Цей режим припускає можливість студента дати відповідь онлайн. Студент може редагувати текст відповіді, використовуючи звичайні засоби редагування (як у форумі, при відправці повідомлення). </p>
<p>Вчитель може написати відгук на відповідь учня і поставити оцінку. Свій відгук вчитель може писати, взявши за основу відповідь, присланий студентом, тобто внести виправлення, коментувати і т.п. При цьому вчитель не повинен забувати виділяти свої коментарі хоча б кольором.
</p>
<p>Для тих, хто знайомий з попередніми версіями moodle, скажемо, що цей режим работи завдання схожий на використання робочого зошиту</p>';
$string['helpuploadsingle'] = '<p>Цей режим припускає можливість учня відправити в якості звіта довільний файл. Наприклад, картинку, документ Word, архів, або що завгодно інше.</p>';
$string['hideintro'] = 'Приховати опис поки завдання не стане доступним';
$string['late'] = 'Термін виконання закінчився $a назад';
$string['maximumgrade'] = 'Максимальная оцінка';
$string['maximumsize'] = 'Максимальний размір';
$string['modulename'] = 'Завдання';
$string['modulenameplural'] = 'Завдання';
$string['newsubmissions'] = 'Запропонувати відповідь';
$string['noassignments'] = 'Відповідей ще нема';
$string['noattempts'] = 'Жодної спроби не було виконано для розміщення відповіді на завдання';
$string['nofilesyet'] = 'Жодного файлу ще не відправлено';
$string['notes'] = 'Коментарії';
$string['notesempty'] = 'Немає записів';
$string['notgradedyet'] = 'Поки ще  не оцінений';
$string['notsubmittedyet'] = 'Відповідь поки ще не відправлена';
$string['onceassignmentsent'] = 'Якщо Ви відправите завдання для отримання оцінки, Ви більше не зможете видаляти або прикріплювати файли. Хочете продовжити?';
$string['overwritewarning'] = 'Попередження: Ваша нова відповідь замінить попередню';
$string['pagesize'] = 'Кількість відповідей на сторінці';
$string['preventlate'] = 'Заборонити відправку відповіді після закінчення терміну виконання';
$string['quickgrade'] = 'Перейти в режим швидкого оцінювання робіт';
$string['responsefiles'] = 'Файли з відповідями';
$string['saveallfeedback'] = 'Зберегти всі виправлення';
$string['sendformarking'] = 'Відправити для отримання оцінки';
$string['submission'] = 'Відповідь';
$string['submissiondraft'] = 'Чернетка відповідей';
$string['submissionfeedback'] = 'Відповідь виправлений';
$string['submissions'] = 'Відповіді';
$string['submissionsaved'] = 'Ваші зміни збережені';
$string['submitassignment'] = 'Відправте Вашу відповідь, використовуючи форму';
$string['submitedformarking'] = 'Завдання відправлене для отримання оцінки і не може бути оновлено';
$string['submitformarking'] = 'Остаточна відправка для отримання оцінки';
$string['submitted'] = 'Відповіді та відгуки';
$string['typeoffline'] = 'Відповідь - поза сайтом';
$string['typeonline'] = 'Відповідь - у вигляді тексту';
$string['typeupload'] = 'Відповідь - у вигляді декількох файлів';
$string['typeuploadsingle'] = 'Відповідь - у вигляді файла';
$string['unfinalize'] = 'Повернути на допрацювання';
$string['uploadbadname'] = 'Цей файл містить неприпустимі символи і не може бути закачаний';
$string['uploadedfiles'] = 'Закачані файли';
$string['uploaderror'] = 'При відправці файла на сервер відбулася помилка';
$string['uploadfailnoupdate'] = 'Файл був закачаний, але не відновити вашу попередню відповідь не вдалося!';
$string['uploadfiletoobig'] = 'Файл занадто великий (обмеження в $a байт)';
$string['uploadnofilefound'] = 'Файл не був знайдений. Ви впевнені, що вибрали його для закачування?';
$string['uploadnotregistered'] = '\'$a\' був закачаний, але відповідь не зареєстрована';
$string['uploadsuccess'] = 'Закачування файлу \'$a\' завершена';
$string['viewfeedback'] = 'Подивитися оцінки завдання і відгуки';
$string['viewsubmissions'] = 'Відповідей на завдання - $a (подивитись)';
$string['yoursubmission'] = 'Ваша відповідь';

?>
