<?PHP // $Id$ 
      // attendanceblk.php - created with Moodle 1.5.3+ (2005060230)


$string['description'] = 'Ви можете додати тільки один даний модуль в кожен курс.<br />
Видалення цього модулю не спричинить видалення даних про відвідуваності! Даний модуль може використовуватися тільки спільно з блоком \"Відвідуваність\" і призначений для додавання балів за відвідуваність в загальну оцінку за курс.';
$string['modulename'] = 'Відвідуваність (для Блоку)';
$string['modulenameplural'] = 'Відвідуваність (для Блоку)';
$string['modulenamesimple'] = 'Відвідуваність';

?>

