<?PHP // $Id: block_glossary_random.php,v 1.1 2007/05/11 14:47:06 evgenij Exp $ 
      // block_glossary_random.php - created with Moodle 1.8 + (2007021502)


$string['addentry'] = 'Додати свої записи!';
$string['askaddentry'] = 'Якщо користувач може додавати записи в глосарій, показувати посилання з цим текстом';
$string['askinvisible'] = 'Якщо користувач не може редагувати або проглядати глоасарій, показувати цей текст (без посилання)';
$string['askviewglossary'] = 'Якщо користувач може проглядати глосарій, але не може додавати нові записи, показувати посилання з цим текстом';
$string['blockname'] = 'Випадковий запис з глосарію';
$string['intro'] = 'Переконайтеся, що у вас в курсі є хоч би один глосарій з принаймні одним записом. У цьому випадку ви можете робити налаштування.';
$string['invisible'] = '(недоступно)';
$string['lastmodified'] = 'Останній змінений запис';
$string['nextone'] = 'Наступний запис';
$string['noentriesyet'] = 'У вибраному глосарії немає жодного запису.';
$string['notyetconfigured'] = 'Будь ласка, проведіть налаштування для цього блоку, скориставшись іконкою редагування.';
$string['notyetglossary'] = 'Для вибору у вас в курсі повинен бути принаймні один глосарій.';
$string['random'] = 'Випадковий запис';
$string['refresh'] = 'Днів до того, як новий запис буде вибраний';
$string['select_glossary'] = 'Вибирати записи з цього глосарію';
$string['showconcept'] = 'Показувати концепцію (заголовок) для кожного запису';
$string['title'] = 'Заголовок';
$string['type'] = 'Як нові записи вибиратимуться';
$string['typehelp'] = '<b>Останній змінений запис</b> - завжди відображається запис, який був змінений останній <b>Випадковий запис</b> - вибирається один випадковий запис при кожному вході на сторінку з блоком. Опція <b>Наступний запис</b> - циклічно відображаються всі записи по одному. Остання опція особливо корисна, коли вказане число днів, що дозволяють зробити <i>\"Цитату тижня</i> або <i>Підказку дня</i>.';
$string['viewglossary'] = 'Всі записи...';
$string['whichfooter'] = 'Ви можете відобразити посиланню на дії в глосарії, з яким проассоциірован блок. Блок відобразить тільки ті дії, які доступні для цього глосарію';

?>
